Repository: AnastasiaZinevich/task5
Catalog: translations/validators.*.xlf
Languages: uz

source: This value should be false.
uz: Qiymat false bo'lishi kerak.

source: This value should be true.
uz: Qiymat true bo'lishi kerak.

source: This value should be of type {{ type }}.
uz: Qiymat turi {{ type }} bo'lishi kerak.

source: This value should be blank.
uz: Qiymat bo'sh bo'lishi kerak.

source: The value you selected is not a valid choice.
uz: Tanlangan qiymat yaroqli emas.

source: You must select at least {{ limit }} choice.|You must select at least {{ limit }} choices.
uz: Siz hech bo'lmaganda {{ limit }} ta qiymat tanlashingiz kerak.|Siz kamida {{ limit }} ta qiymat tanlashingiz kerak.

source: You must select at most {{ limit }} choice.|You must select at most {{ limit }} choices.
uz: Siz {{ limit }} ta qiymatni tanlashingiz kerak.|Siz {{ limit }} dan ortiq qiymat tanlashingiz kerak.

source: One or more of the given values is invalid.
uz: Belgilangan qiymatlarning bir yoki bir nechtasi yaroqsiz.

source: This field was not expected.
uz: Ushbu maydon kutilmagan edi.

source: This field is missing.
uz: Bu maydon majvud emas.

source: This value is not a valid date.
uz: Ushbu sana noto'g'ri.

source: This value is not a valid datetime.
uz: Sana va vaqt qiymati noto'g'ri.

source: This value is not a valid email address.
uz: Elektron pochta manzili noto'g'ri.

source: The file could not be found.
uz: Fayl topilmadi.

source: The file is not readable.
uz: Faylni o'qib bo'lmadi.

source: The file is too large ({{ size }} {{ suffix }}). Allowed maximum size is {{ limit }} {{ suffix }}.
uz: Fayl hajmi katta ({{ size }} {{ suffix }}). Maksimal ruxsat etilgan hajim {{ limit }} {{ suffix }}.

source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}.
uz: Faylning MIME turi noto'g'ri ({{ type }}). Ruxsat etilgan MIME turlar {{ types }}.

source: This value should be {{ limit }} or less.
uz: Qiymat {{ limit }} ga teng yoki kam bo'lishi kerak.

source: This value is too long. It should have {{ limit }} character or less.|This value is too long. It should have {{ limit }} characters or less.
uz: Qiymat juda uzun. {{ limit }} ga teng yoki kam bo'lishi kerak.|Qiymat juda uzun. {{ limit }} yoki undan kam belgidan iborat bo'lishi kerak.

source: This value should be {{ limit }} or more.
uz: Qiymat {{ limit }} yoki undan ortiq bo'lishi kerak.

source: This value is too short. It should have {{ limit }} character or more.|This value is too short. It should have {{ limit }} characters or more.
uz: Qiymat juda qisqa. {{ limit }} ta yoki undan ortiq belgidan iborat bo'lishi kerak.|Qiymat juda qisqa. {{ limit }} yoki undan ko'p belgidan iborat bo'lishi kerak

source: This value should not be blank.
uz: Qiymatni bo'sh kirtish mumkin emas.

source: This value should not be null.
uz: Qiymat null bo'lmasligi kerak.

source: This value should be null.
uz: Qiymat null bo'lishi kerak.

source: This value is not valid.
uz: Qiymat noto'g'ri.

source: This value is not a valid time.
uz: Vaqt noto'g'ri.

source: This value is not a valid URL.
uz: URL noto'g'ri

source: The two values should be equal.
uz: Ikkala qiymat ham bir xil bo'lishi kerak.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
uz: Fayl hajmi katta. Maksimal ruxsat berilgan hajim {{ limit }} {{ suffix }}.

source: The file is too large.
uz: Fayl hajmi katta.

source: The file could not be uploaded.
uz: Faylni yuklab bo'lmadi.

source: This value should be a valid number.
uz: Qiymat raqam bo'lishi kerak.

source: This file is not a valid image.
uz: Fayl yaroqli rasm formati emas.

source: This is not a valid IP address.
uz: Bu qiymat haqiqiy IP manzil emas.

source: This value is not a valid language.
uz: Noto'g'ri til.

source: This value is not a valid locale.
uz: Ushbu qiymat mahalliy qiymat emas.

source: This value is not a valid country.
uz: Mamlakat qiymati noto'g'ri.

source: This value is already used.
uz: Ushbu qiymat allaqachon ishlatilgan.

source: The size of the image could not be detected.
uz: Rasm o'lchamini aniqlab bo'lmadi.

source: The image width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
uz: Rasm kengligi juda katta ({{ width }}px). Maksimal ruxsat etilgan kenglik {{ max_width }}px.

source: The image width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
uz: Rasm kengligi juda kichkina ({{ width }}px). Minimal ruxsat etilgan kenglik {{ min_width }}px.

source: The image height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
uz: Rasm bo'yi juda katta ({{ height }}px). Maksimal ruxsat etilgan balandlik {{ max_height }}px.

source: The image height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
uz: Rasm bo'yi juda kichkina ({{ height }}px). Minimal ruxsat etilgan balandlik {{ min_height }}px.

source: This value should be the user's current password.
uz: Qiymat joriy foydalanuvchi paroli bo'lishi kerak.

source: This value should have exactly {{ limit }} character.|This value should have exactly {{ limit }} characters.
uz: Qiymat {{ limit }} ta belgidan iborat bo'lishi kerak.|Qiymat {{ limit }} belgidan iborat bo'lishi kerak.

source: The file was only partially uploaded.
uz: Fayl faqat qisman yuklangan.

source: No file was uploaded.
uz: Fayl yuklanmagan.

source: No temporary folder was configured in php.ini.
uz: php.ini da vaqtinchalik katalog sozlanmagan, yoki sozlangan katalog mavjud emas.

source: Cannot write temporary file to disk.
uz: Diskka vaqtinchalik faylni yozib bo'lmadi.

source: A PHP extension caused the upload to fail.
uz: PHP kengaytmasi yuklash paytida xatolik yuz berdi.

source: This collection should contain {{ limit }} element or more.|This collection should contain {{ limit }} elements or more.
uz: Ushbu to'plam {{ limit }} ta yoki undan ko'p narsalarni o'z ichiga olishi kerak.|Ushbu to'plam {{ limit }} yoki undan ortiq narsalarni o'z ichiga olishi kerak.

source: This collection should contain {{ limit }} element or less.|This collection should contain {{ limit }} elements or less.
uz: Ushbu to'plam {{ limit }} ta yoki undan kam narsalarni o'z ichiga olishi kerak.|Ushbu to'plamda {{ limit }} yoki undan kam element bo'lishi kerak.

source: This collection should contain exactly {{ limit }} element.|This collection should contain exactly {{ limit }} elements.
uz: Ushbu to'plam to'liq {{ limit }} narsani o'z ichiga olishi kerak.|Ushbu to'plamda to'liq {{ limit }} ta ma'lumotlar bo'lishi kerak.

source: Invalid card number.
uz: Kata raqami noto'g'ri.

source: Unsupported card type or invalid card number.
uz: Qo'llab-quvvatlanmaydigan karta turi yoki yaroqsiz karta raqami.

source: This is not a valid International Bank Account Number (IBAN).
uz: Bu qiymat haqiqiy Xalqaro Bank Hisob Raqami (IBAN) emas.

source: This value is not a valid ISBN-10.
uz: Qiymat to'g'ri ISBN-10 formatida emas.

source: This value is not a valid ISBN-13.
uz: Qiymat to'g'ri ISBN-13 formatida emas.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
uz: Qiymat ISBN-10 va ISBN-13 formatlariga mos kelmaydi.

source: This value is not a valid ISSN.
uz: Qiymat ISSN formatiga mos kelmaydi.

source: This value is not a valid currency.
uz: Noto'g'ri valyuta formati.

source: This value should be equal to {{ compared_value }}.
uz: Qiymat {{ compared_value }} ga teng bo'lishi shart.

source: This value should be greater than {{ compared_value }}.
uz: Qiymat {{ compared_value }} dan katta bo'lishi shart.

source: This value should be greater than or equal to {{ compared_value }}.
uz: Qiymat {{ compared_value }} dan katta yoki teng bo'lishi shart.

source: This value should be identical to {{ compared_value_type }} {{ compared_value }}.
uz: Значение должно быть идентичным {{ compared_value_type }} {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
uz: Qiymat bir xil bo'lishi kerak {{ compared_value }}.

source: This value should be less than or equal to {{ compared_value }}.
uz: Qiymat {{ compared_value }} dan kichik yoki teng bo'lishi shart.

source: This value should not be equal to {{ compared_value }}.
uz: Qiymat {{ compared_value }} ga teng bo'lmasligi kerak.

source: This value should not be identical to {{ compared_value_type }} {{ compared_value }}.
uz: Qiymat bir xil bo'lishi kerak emas {{ compared_value_type }} {{ compared_value }}.

source: The image ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
uz: Rasmning tomonlari nisbati juda katta ({{ ratio }}). Maksimal tomonlar nisbati {{ max_ratio }}.

source: The image ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
uz: Rasmning format nisbati juda kichik ({{ ratio }}). Minimal tomonlar nisbati {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
uz: Rasm kvadrat shaklida ({{ width }}x{{ height }}px). Kvadrat shaklida tasvirlarga ruxsat berilmaydi.

source: The image is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented images are not allowed.
uz: Landshaft tasvir ({{ width }}x{{ height }}px). Landshaft rasmlarga ruxsat berilmaydi.

source: The image is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented images are not allowed.
uz: Portret rasm ({{ width }}x{{ height }}px). Portretlarga ruxsat berilmaydi.

source: An empty file is not allowed.
uz: Bo'sh fayllarga ruxsat berilmagan.

source: The host could not be resolved.
uz: Xost nomini nomiga ruxsat berilmagan.

source: This value does not match the expected {{ charset }} charset.
uz: Qiymat kutilgan {{ charset }} kodlashiga mos kelmaydi.

source: This is not a valid Business Identifier Code (BIC).
uz: Bu qiymat haqiqiy Biznes Identifikatsiya Kodi (BIC) emas.

source: Error
uz: Xatolik

source: This is not a valid UUID.
uz: Bu qiymat haqiqiy UUID emas.

source: This value should be a multiple of {{ compared_value }}.
uz: Qiymat {{ compared_value }} ning ko'paytmasi bo'lishi kerak.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
uz: Ushbu BIC IBAN {{ iban }} bilan bog'liq emas..

source: This value should be valid JSON.
uz: Qiymat to'g'ri JSON bo'lishi kerak.

source: This collection should contain only unique elements.
uz: Ushbu kolleksiyada takroriy elementlar bo'lmasligi kerak.

source: This value should be positive.
uz: Qiymat musbat bo'lishi kerak.

source: This value should be either positive or zero.
uz: Qiymat musbat yoki 0 ga teng bo'lishi kerak.

source: This value should be negative.
uz: Qiymat manfiy bo'lishi kerak.

source: This value should be either negative or zero.
uz: Qiymat manfiy yoki 0 ga teng bo'lishi kerak.

source: This value is not a valid timezone.
uz: Qiymat to'g'ri vaqt zonasi emas.

source: This password has been leaked in a data breach, it must not be used. Please use another password.
uz: Ushbu parol ma'lumotlarning tarqalishi tufayli buzilgan va uni ishlatmaslik kerak. Boshqa paroldan foydalaning.

source: This value should be between {{ min }} and {{ max }}.
uz: Qiymat {{ min }} va {{ max }} oralig'ida bo'lishi shart.

source: This value is not a valid hostname.
uz: Qiymat to'g'ri xost nomi emas.

source: The number of elements in this collection should be a multiple of {{ compared_value }}.
uz: Ushbu to'plamdagi narsalar soni {{ compared_value }} dan ko'p bo'lishi kerak.

source: This value should satisfy at least one of the following constraints:
uz: Qiymat quyidagi cheklovlardan kamida bittasiga javob berishi kerak:

source: Each element of this collection should satisfy its own set of constraints.
uz: Ushbu to'plamdagi har bir narsa o'ziga xos cheklovlarni qondirishi kerak.

source: This value is not a valid International Securities Identification Number (ISIN).
uz: Qiymat Qimmatli qog'ozlarning xalqaro identifikatsiya raqami (ISIN) ga mos emas.

source: This value should be a valid expression.
uz: Ushbu qiymat to'g'ri ifoda bo'lishi kerak.

source: This value is not a valid CSS color.
uz: Bu qiymat haqiqiy CSS rangi emas.

source: This value is not a valid CIDR notation.
uz: Qiymat CIDR belgisiga mos kelmaydi.

source: The value of the netmask should be between {{ min }} and {{ max }}.
uz: Tarmoq niqobining qiymati {{ min }} va {{ max }} oralig'ida bo'lishi kerak.

source: The filename is too long. It should have {{ filename_max_length }} character or less.|The filename is too long. It should have {{ filename_max_length }} characters or less.
uz: Fayl nomi juda uzun. U {{ filename_max_length }} belgidan iborat boʻlishi kerak.|Fayl nomi juda uzun. U {{ filename_max_length }} ta belgidan iborat boʻlishi kerak.

source: The password strength is too low. Please use a stronger password.
uz: Parol kuchi juda past. Iltimos, kuchliroq paroldan foydalaning.

source: This value contains characters that are not allowed by the current restriction-level.
uz: Bu qiymat joriy cheklov darajasida ruxsat etilmagan belgilarni o'z ichiga oladi.

source: Using invisible characters is not allowed.
uz: Ko'rinmas belgilardan foydalanish taqiqlangan.

source: Mixing numbers from different scripts is not allowed.
uz: Turli skriptlardagi raqamlarni aralashtirish taqiqlangan.

source: Using hidden overlay characters is not allowed.
uz: Yashirin qoplamali belgilardan foydalanish taqiqlangan.

source: The extension of the file is invalid ({{ extension }}). Allowed extensions are {{ extensions }}.
uz: Fayl kengaytmasi yaroqsiz ({{ extension }}). Ruxsat berilgan kengaytmalar {{ extensions }}.

source: The detected character encoding is invalid ({{ detected }}). Allowed encodings are {{ encodings }}.
uz: Aniqlangan belgi kodlamasi yaroqsiz ({{ detected }}). Ruxsat etilgan kodlamalar {{ encodings }}.

source: This value is not a valid MAC address.
uz: Bu qiymat haqiqiy MAC manzil emas.

source: This form should not contain extra fields.
uz: Ushbu fo'rmada qo'shimcha maydonlar bo'lmasligi kerak.

source: The uploaded file was too large. Please try to upload a smaller file.
uz: Yuklab olingan fayl juda katta. Iltimos, kichikroq faylni yuklashga harakat qiling.

source: The CSRF token is invalid. Please try to resubmit the form.
uz: CSRF qiymati yaroqsiz. Fo'rmani qayta yuborishga harakat qiling.

source: This value is not a valid HTML5 color.
uz: Qiymat noto'g'ri, HTML5 rangi emas.

source: Please enter a valid birthdate.
uz: Iltimos, tug'ilgan kuningizni to'g'ri kiriting.

source: The selected choice is invalid.
uz: Tanlangan parametr noto'g'ri.

source: The collection is invalid.
uz: Kolleksiya noto'g'ri

source: Please select a valid color.
uz: Iltimos, to'g'ri rang tanlang.

source: Please select a valid country.
uz: Iltimos, to'g'ri mamlakatni tanlang.

source: Please select a valid currency.
uz: Iltimos, to'g'ri valyutani tanlang.

source: Please choose a valid date interval.
uz: Iltimos, to'g'ri sana oralig'ini tanlang.

source: Please enter a valid date and time.
uz: Iltimos, to'g'ri sana va vaqtni kiriting.

source: Please enter a valid date.
uz: Iltimos, to'g'ri sanani kiriting.

source: Please select a valid file.
uz: Iltimos, to'g'ri faylni tanlang.

source: The hidden field is invalid.
uz: Yashirin maydon qiymati yaroqsiz.

source: Please enter an integer.
uz: Iltimos, butun son kiriting.

source: Please select a valid language.
uz: Iltimos, to'g'ri tilni tanlang.

source: Please select a valid locale.
uz: Iltimos, to'g'ri localni tanlang.

source: Please enter a valid money amount.
uz: Iltimos, tegishli miqdordagi pulni kiriting.

source: Please enter a number.
uz: Iltimos, raqam kiriting.

source: The password is invalid.
uz: Parol noto'g'ri.

source: Please enter a percentage value.
uz: Iltimos, foyizli qiymat kiriting.

source: The values do not match.
uz: Qiymatlar mos kelmaydi.

source: Please enter a valid time.
uz: Iltimos, to'g'ri vaqtni tanlang.

source: Please select a valid timezone.
uz: Iltimos, to'g'ri vaqt zonasini tanlang.

source: Please enter a valid URL.
uz: Iltimos, to'g'ri URL kiriting.

source: Please enter a valid search term.
uz: Iltimos, to'g'ri qidiruv so'zini kiriting.

source: Please provide a valid phone number.
uz: Iltimos, to'g'ri telefon raqamini kiriting.

source: The checkbox has an invalid value.
uz: Belgilash katagida yaroqsiz qiymat mavjud.

source: Please enter a valid email address.
uz: Iltimos, to'g'ri email kiriting.

source: Please select a valid option.
uz: Iltimos, yaroqli variantni tanlang.

source: Please select a valid range.
uz: Iltimos, yaroqli oraliqni tanlang.

source: Please enter a valid week.
uz: Iltimos, haqiqiy haftani kiriting.
